# Pandas

In [1]:
#Мирзоян Виктория
import numpy as np
import pandas as pd

In [2]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [3]:
df_1=pd.DataFrame(
    {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
     'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
     'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
     'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']},
     index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
     #index = pd.MultiIndex.from_tuples([('a',0), ('b',1),('c',2), ('d',3), ('e',4), ('f',5), ('g',6), ('h',7),('i',8),('j',9)]))

#### 1. Вывести информацию о датафрейме.

In [4]:
df_1

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [5]:
df_1[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [6]:
df_1.loc['a'::,'animal':'age']

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [7]:
print("3 элемент  в столбце 'animal' - ",df_1.at[('d'), 'animal'])
print("3 элемент  в столбце 'age' - ",df_1.at[('d'), 'age'])
print("4 элемент  в столбце 'animal' - ",df_1.at[('e'), 'animal'])
print("4 элемент  в столбце 'age' - ",df_1.at[('e'), 'age'])
print("8 элемент  в столбце 'animal' - ",df_1.at[('i'), 'animal'])
print("8 элемент  в столбце 'age' - ",df_1.at[('i'), 'age'])

3 элемент  в столбце 'animal' -  dog
3 элемент  в столбце 'age' -  nan
4 элемент  в столбце 'animal' -  dog
4 элемент  в столбце 'age' -  5.0
8 элемент  в столбце 'animal' -  dog
8 элемент  в столбце 'age' -  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [8]:
df_1[df_1['visits']>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [9]:
df_1[df_1['age'].isnull()==True]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [10]:
df_1[(df_1['animal']=='cat') & (df_1['age']>=3)]

  animal  age  visits priority
b    cat  3.0       3      yes

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [11]:
df_1[(df_1['age']>=2) & (df_1['age']<=4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [12]:
df_1.at[('f'), 'age']=1.5
df_1

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 10. Рассчитать общее количество всех посещений.

In [13]:
df_1['visits'].sum()

19

#### 11. Расчитайте суммарный возраст животных

In [14]:
df_1['age'].sum()

27.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [15]:
df_1.loc['k'] = ['dog', 6.5, 4, 'no']
print(df_1)
df_1.drop('k')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
k    dog  6.5       4       no

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [16]:
cats=df_1.groupby(['animal']).size()
cats

animal
cat      4
dog      5
snake    2
dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [50]:
df_1=df_1.sort_values(['age'], ascending=[True]).head()
df_1=df_1.sort_values(['visits'], ascending=[True]).head()
df_1

AttributeError: 'NoneType' object has no attribute 'sort_values'

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [53]:
df_1=df_1.replace(['no', 'yes'], ['No', 'Yes'], inplace=True)
df_1

AttributeError: 'NoneType' object has no attribute 'replace'

#### 16. В столбце «animal» измените записи «snake» на «python».

In [54]:
df_1=df_1.replace(['snake'], ['python'], inplace=True)
df_1

AttributeError: 'NoneType' object has no attribute 'replace'

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [30]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.drop_duplicates(subset='A', keep="last")

    A
0   1
2   2
3   3
4   4
7   5
8   6
10  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [73]:
df_2 = pd.DataFrame(np.random.random (size = (10, 10)), index = list('abcdefghij'))
a=min(df_2[0].sum(),df_2[1].sum(),df_2[2].sum(),df_2[3].sum(),df_2[4].sum(),df_2[5].sum(),df_2[6].sum(),df_2[7].sum(),df_2[8].sum(),df_2[9].sum())
df_2.loc['min values'] = [df_2[0].sum(),df_2[1].sum(),df_2[2].sum(),df_2[3].sum(),df_2[4].sum(),df_2[5].sum(),df_2[6].sum(),df_2[7].sum(),df_2[8].sum(),df_2[9].sum()]
print(a)
df_2

3.0989547577719176

,0,1,2,3,4,5,6,7,8,9
a,0.993439,0.797564,0.337682,0.264999,0.702613,0.189712,0.662864,0.666096,0.348355,0.738407
b,0.642491,0.310718,0.495816,0.234711,0.979061,0.755707,0.662166,0.716420,0.252487,0.515897
c,0.624148,0.883833,0.978773,0.572260,0.508648,0.554264,0.615580,0.629408,0.005491,0.977928
d,0.681945,0.306225,0.226983,0.449544,0.851326,0.231224,0.186348,0.168439,0.126107,0.281875
e,0.923753,0.864953,0.778457,0.283914,0.446365,0.002586,0.154565,0.718822,0.454810,0.513419
f,0.087229,0.205533,0.753610,0.053385,0.619632,0.912263,0.620776,0.858448,0.229284,0.652661
g,0.309603,0.577285,0.474482,0.925285,0.091752,0.259883,0.963911,0.077580,0.677482,0.826092
h,0.047868,0.836518,0.540246,0.833092,0.817127,0.722912,0.034926,0.973054,0.587407,0.302244
i,0.056014,0.317753,0.494319,0.775670,0.756311,0.166547,0.224559,0.814203,0.307359,0.676059
j,0.958504,0.955240,0.933237,0.679292,0.539976,0.900848,0.933817,0.699070,0.110174,0.044034
min values,5.324995,6.055622,6.013603,5.072152,6.312812,4.695946,5.059512,6.321542,3.098955,5.528616

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [41]:
df_3 = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
df_3
df_3.fillna(df_3.mean())

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [68]:
df_4 = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df_4
df_4['From']=np.nan
df_4['To']=np.nan
df_4

            From_To  FlightNumber  RecentDelays              Airline  From  To
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)   NaN NaN
1      MAdrid_miLAN           NaN            []    <Air France> (12)   NaN NaN
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )   NaN NaN
3    Budapest_PaRis           NaN          [13]       12. Air France   NaN NaN
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"   NaN NaN